const truths = [
  "ليه اللي بيلاحظ زيادة بيشيل زيادة؟",
  "وليه اللي بيحاول ما يوجّعش بيتوجّع أكترمن اي حد تاني؟",
  "أنا عمري ما طلبت كتير كنت بطلب بس ما أتحطّش في موقف أختار فيه بين قلبي وكرامتي",
  "هو الطبيعي إن اللي بيحب بيدفع تمن حبّه لوحده؟",
  "ولا المشكلة إن الناس اتعوّدت تاخد اللي بيدّي من غير ما تحس؟",
  "أنا مش زعلان أنا بس تعبت من إن الوجع دايمًا بييجي من نفس الاتجاه",
  "مكنتش بسأل عشان الوم , كنت بسال عشان افهم ",
  "واديني لسه بحاول افهم",
  "يمكن اي حد غيري كان خد الموضوع بطريقه اسهل",
  "حاولت اريح دماغي معرفتش",
  "وبالرغم من اني بشوفك طول الوقت جوا دماغي",
   "يمكن كنت نفسي حد يحبني وانا في اسوأ حالاتي ، فقلت اكون الشخص دا ف حيات حد يستحقها فعلا",
   ". . ."


];

let index = 0;

function nextTruth() {
    const textEl = document.getElementById("truthText");

    if (index >= truths.length) return;

    // نخفي النص
    textEl.classList.remove("show");

    setTimeout(() => {
        textEl.innerHTML = truths[index];
        textEl.classList.add("show");
        index++;
        if (index === truths.length) {
            index = 0; // 🔁 يرجع لأول جملة
        }
    }, 300);
}


